SensorsINI/WecareBLEDevice/projects/target_apps/ble_examples/DA14531_USB_Preloaded_Firmware/src/user_peripheral.c
                case SVC1_IDX_LONG_VALUE_VAL:
                    user_svc1_long_val_wr_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

                default:
                    break;
            }
        } break;

        case CUSTS1_VAL_NTF_CFM:
        {
            struct custs1_val_ntf_cfm const *msg_param = (struct custs1_val_ntf_cfm const *)(param);

            switch (msg_param->handle)
            {
                case SVC1_IDX_ADC_VAL_1_VAL:
                    break;

                case SVC1_IDX_BUTTON_STATE_VAL:
                    break;

                case SVC1_IDX_LONG_VALUE_VAL:
                    break;

                default:
                    break;
            }
        } break;

        case CUSTS1_VAL_IND_CFM:
        {
            struct custs1_val_ind_cfm const *msg_param = (struct custs1_val_ind_cfm const *)(param);

            switch (msg_param->handle)
            {
                case SVC1_IDX_INDICATEABLE_VAL:
                    break;

                default:
                    break;
             }
        } break;

        case CUSTS1_ATT_INFO_REQ:
        {
            struct custs1_att_info_req const *msg_param = (struct custs1_att_info_req const *)param;

            switch (msg_param->att_idx)
            {
                case SVC1_IDX_LONG_VALUE_VAL:
                    user_svc1_long_val_att_info_req_handler(msgid, msg_param, dest_id, src_id);
                    break;

                default:
                    user_svc1_rest_att_info_req_handler(msgid, msg_param, dest_id, src_id);
                    break;
             }
        } break;

        case GAPC_PARAM_UPDATED_IND:
        {
            // Cast the "param" pointer to the appropriate message structure
            struct gapc_param_updated_ind const *msg_param = (struct gapc_param_updated_ind const *)(param);

            // Check if updated Conn Params filled to preferred ones
            if ((msg_param->con_interval >= user_connection_param_conf.intv_min) &&
                (msg_param->con_interval <= user_connection_param_conf.intv_max) &&
                (msg_param->con_latency == user_connection_param_conf.latency) &&
                (msg_param->sup_to == user_connection_param_conf.time_out))
            {
            }
        } break;

        case CUSTS1_VALUE_REQ_IND:
        {
            struct custs1_value_req_ind const *msg_param = (struct custs1_value_req_ind const *) param;

            switch (msg_param->att_idx)
            {
                case SVC3_IDX_READ_4_VAL:
                {
                    user_svc3_read_non_db_val_handler(msgid, msg_param, dest_id, src_id);
                } break;

                default:
                {
                    // Send Error message
                    struct custs1_value_req_rsp *rsp = KE_MSG_ALLOC(CUSTS1_VALUE_REQ_RSP,
                                                                    src_id,
                                                                    dest_id,
                                                                    custs1_value_req_rsp);

                    // Provide the connection index.
                    rsp->conidx  = app_env[msg_param->conidx].conidx;
                    // Provide the attribute index.
                    rsp->att_idx = msg_param->att_idx;
                    // Force current length to zero.
                    rsp->length = 0;
                    // Set Error status
                    rsp->status  = ATT_ERR_APP_ERROR;
                    // Send message
                    ke_msg_send(rsp);
                } break;
             }
        } break;

        default:
            break;
    }
}


// Initialize SPI2 IO driver
spi_cfg_t spi2_cfg = {  .spi_ms = SPI_MS_MODE_MASTER,
                        .spi_cp = SPI_CP_MODE_0,            // SPI Mode 0,0
                        .spi_speed = SPI_SPEED_MODE_2MHz,
                        .spi_wsz = SPI_MODE_16BIT,
                        .spi_cs = SPI_CS_0,                 
                        .cs_pad.port = SPI2_IO_CS_PORT,
                        .cs_pad.pin = SPI2_IO_CS_PIN
#if defined(CFG_SPI_DMA_SUPPORT)
#endif
};

// Initialize SPI2 DAC driver
spi_cfg_t spi2_dac_cfg = {  
	                      .spi_ms = SPI_MS_MODE_MASTER,
                        .spi_cp = SPI_CP_MODE_1,            // SPI Mode 0,1
                        .spi_speed = SPI_SPEED_MODE_2MHz,
                        .spi_wsz = SPI_MODE_32BIT,
                        .spi_cs = SPI_CS_0,                
                        .cs_pad.port = SPI2_DAC_CS_PORT,
                        .cs_pad.pin = SPI2_DAC_CS_PIN
#if defined(CFG_SPI_DMA_SUPPORT)
#endif
};

// Initialize SPI2 DAC driver
spi_cfg_t spi2_adc1_cfg = {  
	                      .spi_ms = SPI_MS_MODE_MASTER,
                        .spi_cp = SPI_CP_MODE_0,            // SPI Mode 0,0
                        .spi_speed = SPI_SPEED_MODE_2MHz,
                        .spi_wsz = SPI_MODE_8BIT,
                        .spi_cs = SPI_CS_1,                 
                        .cs_pad.port = SPI2_ADC1_CS_PORT,
                        .cs_pad.pin = SPI2_ADC1_CS_PIN
#if defined(CFG_SPI_DMA_SUPPORT)
#endif
};

// LED2 on wecare board (MAX7317 P2)
// The higest 8bits are port number (MSB for R/W_n)
// The loweset 8bits are value.
// On the board, '0' turns on the LED, '1' turns off.
uint16_t reg_val_led2 = 0x0201;
// LED3 on wecare board (MAX7317 P3)
uint16_t reg_val_led3 = 0x0300;

uint16_t globalCnt = 0;

/**
 ****************************************************************************************
 * @brief SPI2 IO module (MAX7317) test timer callback function.
 * @return void
 ****************************************************************************************
*/
static void spi2_io_ctrl()
{
    spi_initialize(&spi2_cfg);

    // for (uint8_t i=0; i<0xFF; i++) {
    reg_val_led2 ^= 1;
    reg_val_led3 ^= 1;

    // For LED 2  
    // spi_ctrl_reg_spi_fifo_reset_setf(SPI_BIT_DIS);	
    // GPIO_SetInactive(SPI2_IO_CS_PORT, SPI2_IO_CS_PIN);	
	  // timer0_2_clk_enable(); 
    // Enable SWTIM_IRQn irq
    // timer0_enable_irq(); 
    // Start Timer0
    // timer0_start();	
	  // for(uint64_t i = 0; i < 5; i++);
		// GPIO_SetActive(SPI2_IO_CS_PORT, SPI2_IO_CS_PIN);

    spi_cs_low();
	  spi_send(&reg_val_led2, 1, SPI_OP_BLOCKING);
    spi_cs_high();
		  
    // For LED 3
    spi_cs_low();
    spi_send(&reg_val_led3, 1, SPI_OP_BLOCKING);
    spi_cs_high();
    // }

    // Restart timer for the next SPI2 transaction. Delay time: 50*10ms = 500ms
    app_spi2_timer_used = app_easy_timer(50, spi2_io_ctrl);
}

/**
 ****************************************************************************************
 * @brief SPI2 DAC (DAC70508M) control function.
 * @return void
 ****************************************************************************************
*/
static void spi2_dac_ctrl()
{
    spi_initialize(&spi2_dac_cfg);

    uint16_t regData; 

