SensorsINI/WecareBLEDevice/projects/target_apps/ble_examples/DA14531_USB_Preloaded_Firmware/src/user_peripheral.c
    if(!spi2_dac_read_register(DEVICE_ID, &regData)) 
		{
			  // da14531_printf("DEVICE ID is: 0x%x.\r\n", regData);			
		}

    if(!spi2_dac_read_register(GAIN, &regData)) 
		{
			  // da14531_printf("GAIN channel 4 register is: 0x%x.\r\n", regData);			
		}

    if(!spi2_dac_read_register(STATUS, &regData))  
		{
			  // da14531_printf("STATUS channel 4 register is: 0x%x.\r\n", regData);			
		}
				
//		// Reset the device
//		spi2_dac_write_register(TRIGGER, 0xa);
    
		spi2_dac_write_register(GAIN, 0x1ff);
    if(!spi2_dac_read_register(STATUS, &regData))  
		{
			  // da14531_printf("STATUS channel 4 register is: 0x%x.\r\n", regData);			
		}
    
		// spi2_dac_write_register(BRDCAST, 0xafff);
    if(!spi2_dac_read_register(DAC4, &regData))  
		{
			  // da14531_printf("DAC channel 4 register is: 0x%x.\r\n", regData);
		}
	  spi2_dac_write_register(DAC0, globalDACVal);
	  spi2_dac_write_register(DAC1, 0x2fff);
	  spi2_dac_write_register(DAC2, 0xffff);		
	  spi2_dac_write_register(DAC3, 0xffff);
		
		// spi2_dac_write_register(CONFIG, 0x0ff);
    app_spi2_dac_timer_used = app_easy_timer(50, spi2_dac_ctrl);
}

static bool initFlag = true;   // Make sure initilization only execute once
/**
 ****************************************************************************************
 * @brief SPI2 ADC1 module (MCP3564R) init function.
 * @return void
 ****************************************************************************************
*/
static void spi2_adc1_init(void)
{	
	  uint32_t regVal;
	  uint8_t sendBuf[TOTAL_BYTES] = {0};
	  uint8_t receiveBuf[TOTAL_BYTES] = {0}; 
 
		// Full reset
		spi2_adc_fast_command(FAST_CMD_FULL_RESET);

		// Read all the register values.
		spi2_adc_increment_read_register(ADCDATA, receiveBuf, TOTAL_BYTES);

//		// Configure CONFIG2 register: GAIN('000'): set gain to 1/3.
//		sendBuf[0] = 0x83; 
//		spi2_adc_write_register(CONFIG2, sendBuf, CONFIG2_BYTES);	
		
		// Configure CONFIG3 register: CONV_MODE('11'): Continous conversion in scan mode. DATA_FORMAT('10'): 32bit without channel ID.
		sendBuf[0] = 0xE0; 
		spi2_adc_write_register(CONFIG3, sendBuf, CONFIG3_BYTES);	
		
		// Configure IRQ regiseter: IRQ_Mode('01'): IRQ output and inactive state is logic high
		// This configuration is important, because if we use the default configuration, then
		// IRQ is in high-Z state and because we don't have external pull-up resistor on board.
		// Therefore, IRQ cannot generate falling edge and SDO cannot be updated resulting in 
		// SPI reading on ADCDATA always 0.
		sendBuf[0] = 0x07;
		spi2_adc_write_register(IRQ, sendBuf, IRQ_BYTES);
		
		// Configure MUX register: AVDD reading
		sendBuf[0] = 0x98;
		spi2_adc_write_register(MUX, sendBuf, MUX_BYTES);
		
//		// Configure SCAN register: Single-ended input for CH0
//		sendBuf[0] = 0x00;
//		sendBuf[1] = 0xFF;
//		sendBuf[2] = 0xFF;
//		spi2_adc_write_register(SCAN, sendBuf, SCAN_BYTES);

		// Configure CONFIG0 register: Internal V_ref and internal master clock, no bias and ADC conversion mode.
		// This register configuration should be put in the last of init function as this register is used to start
		// the conversion.
		sendBuf[0] = 0xF3;  // The first byte is the MSbs for registers have more than 8bits
		// sendBuf[1] = 0x02;
		// sendBuf[2] = 0x03;
		spi2_adc_write_register(CONFIG0, sendBuf, CONFIG0_BYTES);
		
		// Read CONFIG0 register.
		spi2_adc_static_read_register(CONFIG0, receiveBuf, CONFIG0_BYTES);	
		regVal = swapBufToRealVal(receiveBuf, CONFIG0_BYTES);
		// da14531_printf("CONFIG0 register data is: 0x%x.\r\n", regVal);
}

/**
 ****************************************************************************************
 * @brief SPI2 ADC1 module (MCP3564R) test timer callback function.
 * @return void
 ****************************************************************************************
*/
static void spi2_adc1_ctrl()
{ 
    spi_initialize(&spi2_adc1_cfg);
	
    uint32_t regVal = 0;	
		uint8_t sendBuf[TOTAL_BYTES] = {0};	
    uint8_t receiveBuf[TOTAL_BYTES] = {0}; 
 
		if(initFlag)
		{			
				spi2_adc1_init();
				// Configure MUX register: Single-ended channel CH0
				sendBuf[0] = 0x08;
				spi2_adc_write_register(MUX, sendBuf, MUX_BYTES);			
				initFlag = false;
		}
		
		// Read all the register values.
		spi2_adc_increment_read_register(ADCDATA, receiveBuf, TOTAL_BYTES);

		uint8_t irqVal = swapBufToRealVal(receiveBuf, IRQ_BYTES);
		while((irqVal & 0x40) != 0)
		{
				spi2_adc_static_read_register(IRQ, receiveBuf, IRQ_BYTES);
				irqVal = swapBufToRealVal(receiveBuf, IRQ_BYTES);
		}			

		spi2_adc_static_read_register(CONFIG2, receiveBuf, CONFIG2_BYTES);	
		regVal = swapBufToRealVal(receiveBuf, CONFIG2_BYTES);
    // Obtain the GAIN bits value
		uint8_t gainReg = (regVal & 0x38) >> 3;
	  // Convert it to the real gain
		float gainFactor = 0.333;  // if gainReg == 0, then gainFactor is 1/3
		if(gainReg != 0)
		{
			gainFactor = 1 << (gainReg - 1);
		}		
		
		// STATIC Read ADCDATA
		spi2_adc_static_read_register(ADCDATA, receiveBuf, ADCDATA_BYTES);	
		regVal = swapBufToRealVal(receiveBuf, ADCDATA_BYTES);
		int32_t voltageVal = (int32_t)(regVal);
		float voltage = voltageVal/(0x800000 * gainFactor) * 2.4;    // The internal reference voltage is 2.4V
		da14531_printf("The voltage is: %.4fV.\r\n",  voltage);
		
		// Value shared with BLE for sending to the host
		globalADCVal = regVal;
		
    app_spi2_adc1_timer_used = app_easy_timer(50, spi2_adc1_ctrl);
}

/// @} APP
